#### Terraform format and style: `success`
#### Terraform initialization: `success`
#### Terraform validation: `success`

<details><summary>Show validation output</summary>

```

$ terraform validate
Success! The configuration is valid.


```

</details>

#### Terraform plan: `success`

<details><summary>Show plan</summary>

```

$ terraform plan
Acquiring state lock. This may take a few moments...
module.thanos.module.thanos.null_resource.dependencies: Refreshing state... [id=1330642774921619759]
module.thanos.module.thanos.null_resource.this: Refreshing state... [id=413328150136466538]
module.thanos.module.thanos.random_password.oauth2_cookie_secret: Refreshing state... [id=none]
module.eks.module.cluster.data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0655b091c383d04e3]
module.eks.module.cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.cluster.module.kms.data.aws_caller_identity.current: Reading...
module.eks.module.cluster.data.aws_caller_identity.current: Reading...
module.iam_assumable_role_thanos.data.aws_caller_identity.current: Reading...
module.iam_assumable_role_thanos.data.aws_partition.current: Reading...
aws_s3_bucket.loki_log_storage: Refreshing state... [id=loki-log-storage-gh-v1-cluster]
data.aws_availability_zones.available: Reading...
module.iam_assumable_role_thanos.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_assumable_role_loki.data.aws_caller_identity.current: Reading...
aws_s3_bucket.thanos_metrics_storage: Refreshing state... [id=thanos-metrics-storage-gh-v1-cluster]
module.eks.module.cluster.data.aws_default_tags.current: Reading...
module.eks.module.cluster.data.aws_default_tags.current: Read complete after 0s [id=aws]
aws_cognito_user_pool.pool: Refreshing state... [id=eu-west-1_S4w8tEVAZ]
aws_efs_file_system.eks: Refreshing state... [id=fs-00f94e10c3215ff5b]
module.eks.module.cluster.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=047488060046]
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.eks.module.cluster.module.kms.data.aws_partition.current: Reading...
module.eks.module.cluster.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_assumable_role_loki.data.aws_partition.current: Reading...
module.iam_assumable_role_loki.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/gh-v1-cluster/cluster]
module.eks.module.cluster.data.aws_caller_identity.current: Read complete after 0s [id=047488060046]
module.eks.data.aws_route53_zone.this[0]: Reading...
module.iam_assumable_role_thanos.data.aws_caller_identity.current: Read complete after 0s [id=047488060046]
module.eks.module.cluster.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.cluster.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.iam_assumable_role_loki.data.aws_caller_identity.current: Read complete after 0s [id=047488060046]
module.eks.module.cluster.aws_iam_role.this[0]: Refreshing state... [id=gh-v1-cluster-cluster-20221122065634177600000001]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-021fda2f554e44e21]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e3f8465a96a58ecb]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-03a88e518253a49f0]
aws_cognito_user_group.argocd_admin_group: Refreshing state... [id=eu-west-1_S4w8tEVAZ/argocd-admin]
aws_cognito_user_pool_domain.pool_domain: Refreshing state... [id=gh-v1-cluster]
module.eks.data.aws_route53_zone.this[0]: Read complete after 2s [id=Z02344701J76N99N4DJK6]
module.eks.module.cluster.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=gh-v1-cluster-cluster-20221122065634177600000001-20221122065635105100000002]
module.eks.module.cluster.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=gh-v1-cluster-cluster-20221122065634177600000001-20221122065635108500000003]
module.eks.module.cluster.aws_security_group.cluster[0]: Refreshing state... [id=sg-09ba920a5168ce190]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0522e332a6500e6e3]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d289f4aa4745f4d2]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0a017035c7bff0463]
module.eks.module.cluster.aws_security_group.node[0]: Refreshing state... [id=sg-0195a04ea038c4cda]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-087310099fc48d7f0]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c299ecf5d66ba8db]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-05921da0cb5a021b6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05ba84bdb8c7c6811]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c205d256b3a9510a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04c4a22def898175b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a6e3dad990315008]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-074c30b0351974378]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-05921da0cb5a021b61080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-035a6007acf32c869]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0647a5d61ba079953]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0022d15e9539d1836]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0fb9acb3950f3bf51]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-059149937b75fabf8]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-034e9060add505fde]
module.eks.module.cluster.aws_security_group_rule.node["ingress_all_https"]: Refreshing state... [id=sgrule-95706753]
module.eks.module.cluster.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2596166861]
module.eks.module.cluster.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-2775334298]
module.eks.module.cluster.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-3690076311]
module.eks.module.cluster.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2058485892]
module.eks.module.cluster.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2128246675]
module.eks.module.cluster.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-242876896]
module.eks.module.cluster.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2149417862]
module.eks.module.cluster.aws_security_group_rule.node["ingress_cluster_to_nodes_metrics_server"]: Refreshing state... [id=sgrule-707688441]
module.eks.module.cluster.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-288602630]
module.eks.module.cluster.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-190461190]
module.eks.module.cluster.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3043760617]
module.eks.module.cluster.aws_security_group_rule.node["ingress_all_http"]: Refreshing state... [id=sgrule-1732976188]
module.eks.module.cluster.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-1830788629]
module.eks.module.cluster.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-2089480133]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ca9e7411c7786b1b]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07917b2ecf5ffcd61]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-060ae99968c903ddb]
module.eks.module.cluster.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-1928690248]
module.eks.module.cluster.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-1991017786]
module.eks.module.cluster.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-2332679096]
module.eks.module.cluster.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3376553639]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04c4a22def898175b1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0a6e3dad9903150081080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-074c30b03519743781080289494]
module.eks.module.nlb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:loadbalancer/net/gh-v1-cluster/92ba447342597e91]
aws_security_group.efs_eks: Refreshing state... [id=sg-0b6342298209c60a4]
data.aws_iam_policy_document.thanos_s3_policy: Reading...
data.aws_iam_policy_document.thanos_s3_policy: Read complete after 0s [id=3203450087]
data.aws_iam_policy_document.loki_s3_policy: Reading...
aws_iam_policy.thanos_s3_policy: Refreshing state... [id=arn:aws:iam::047488060046:policy/thanos-s3-20221122065640688500000004]
data.aws_iam_policy_document.loki_s3_policy: Read complete after 0s [id=465421725]
aws_iam_policy.loki_s3_policy: Refreshing state... [id=arn:aws:iam::047488060046:policy/loki-s3-20221122110439771800000001]
module.eks.module.cluster.aws_eks_cluster.this[0]: Refreshing state... [id=gh-v1-cluster]
aws_efs_mount_target.eks[1]: Refreshing state... [id=fsmt-033a5f0621658387d]
aws_efs_mount_target.eks[2]: Refreshing state... [id=fsmt-0a8c4d0fe29047ce0]
aws_efs_mount_target.eks[0]: Refreshing state... [id=fsmt-01d4bec1fdc68caed]
module.eks.module.cluster.data.tls_certificate.this[0]: Reading...
module.iam_assumable_role_loki.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.iam_assumable_role_thanos.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.iam_assumable_role_loki.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=2689556546]
module.iam_assumable_role_thanos.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=1029160225]
module.iam_assumable_role_loki.aws_iam_role.this[0]: Refreshing state... [id=loki-s3-role-gh-v1-cluster]
module.eks.data.aws_eks_cluster_auth.cluster: Reading...
module.eks.data.aws_iam_policy_document.cluster_autoscaler: Reading...
module.iam_assumable_role_thanos.aws_iam_role.this[0]: Refreshing state... [id=thanos-s3-role-gh-v1-cluster]
module.eks.data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=gh-v1-cluster]
module.eks.data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=98148458]
module.eks.module.cluster.data.tls_certificate.this[0]: Read complete after 0s [id=a5615580cbd9272bdae2e3906bc02344ec342de6]
module.eks.module.cluster.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::047488060046:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/4E77C1B36279EE76EE8DDCD760A6EBD5]
module.eks.module.nlb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:targetgroup/gh-v120221122065946946900000007/187bb112b8bb6baa]
module.eks.module.nlb.aws_lb_target_group.main[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:targetgroup/gh-v120221122065946947800000008/e6488f26fa2c2d61]
module.eks.data.dns_a_record_set.nlb: Reading...
module.eks.aws_route53_record.wildcard[0]: Refreshing state... [id=Z02344701J76N99N4DJK6_*.apps.gh-v1-cluster_CNAME]
module.eks.data.dns_a_record_set.nlb: Read complete after 0s [id=gh-v1-cluster-92ba447342597e91.elb.eu-west-1.amazonaws.com]
module.iam_assumable_role_loki.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=loki-s3-role-gh-v1-cluster-20221122110441593700000002]
module.iam_assumable_role_thanos.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=thanos-s3-role-gh-v1-cluster-20221122070702654500000010]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_ami.eks_default[0]: Reading...
module.eks.module.nlb.aws_lb_listener.frontend_http_tcp[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:listener/net/gh-v1-cluster/92ba447342597e91/897bca8ff5959498]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_default_tags.current: Reading...
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_partition.current: Reading...
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_default_tags.current: Read complete after 0s [id=aws]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_caller_identity.current: Reading...
module.eks.module.nlb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:listener/net/gh-v1-cluster/92ba447342597e91/9bfd78061e299170]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_role.this[0]: Refreshing state... [id=gh-v1-cluster-main-node-group-20221122065949111700000009]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_caller_identity.current: Read complete after 0s [id=047488060046]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_ami.eks_default[0]: Read complete after 1s [id=ami-08850ac468211be43]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=gh-v1-cluster-main-node-group-20221122065949111700000009-2022112206594994720000000c]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=gh-v1-cluster-main-node-group-20221122065949111700000009-2022112206594991690000000b]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_instance_profile.this[0]: Refreshing state... [id=gh-v1-cluster-main-node-group-2022112206594981870000000a]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=gh-v1-cluster-main-node-group-20221122065949111700000009-2022112206594995070000000d]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_launch_template.this[0]: Refreshing state... [id=lt-0c3733cdd3ebcff58]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_autoscaling_group.this[0]: Refreshing state... [id=gh-v1-cluster-main-20221122070703114500000011]
module.eks.module.cluster.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.module.cluster.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.oidc.null_resource.dependencies: Refreshing state... [id=5749727696633829789]
module.oidc.data.aws_region.current: Reading...
module.oidc.aws_cognito_user_pool_client.client: Refreshing state... [id=4cfi6tn57gj0qdr483h0qu2nug]
module.argocd_bootstrap.time_static.iat: Refreshing state... [id=2022-11-22T07:07:28Z]
module.oidc.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.argocd_bootstrap.random_uuid.jti: Refreshing state... [id=c1140237-c5a9-3113-2e58-5da628950ac0]
module.argocd_bootstrap.random_password.argocd_server_admin: Refreshing state... [id=none]
module.argocd_bootstrap.random_password.oauth2_cookie_secret: Refreshing state... [id=none]
module.argocd_bootstrap.random_password.argocd_server_secretkey: Refreshing state... [id=none]
module.argocd_bootstrap.htpasswd_password.argocd_server_admin: Refreshing state... [id=PW243261243130244b4f2e6d2f3669585557343942444b6f3868506770656762576431732e344e716f527064694c3976544c624443467934446930716d]
module.argocd_bootstrap.jwt_hashed_token.argocd: Refreshing state... [id={"iat":1669100848,"iss":"argocd","jti":"c1140237-c5a9-3113-2e58-5da628950ac0","nbf":1669100848,"sub":"pipeline"}]
module.argocd_bootstrap.data.utils_deep_merge_yaml.values: Reading...
module.argocd_bootstrap.data.utils_deep_merge_yaml.values: Read complete after 0s [id=bebb942226af88617f8909992f5b7a02ec756190]
module.argocd_bootstrap.helm_release.argocd: Refreshing state... [id=argocd]
module.thanos.module.thanos.argocd_project.this: Refreshing state... [id=thanos]
module.thanos.module.thanos.argocd_application.this: Refreshing state... [id=thanos]
module.oidc.null_resource.this: Refreshing state... [id=6389154664614586988]
module.argocd_bootstrap.null_resource.this: Refreshing state... [id=45992919353113064]
module.ingress.module.traefik.module.traefik.null_resource.dependencies: Refreshing state... [id=8599420673131578707]
module.ingress.module.traefik.module.traefik.data.utils_deep_merge_yaml.values: Reading...
module.efs.data.utils_deep_merge_yaml.values: Reading...
module.efs.argocd_project.this: Refreshing state... [id=efs-csi-driver]
module.ingress.module.traefik.module.traefik.argocd_project.this: Refreshing state... [id=traefik]
module.ingress.module.traefik.module.traefik.data.utils_deep_merge_yaml.values: Read complete after 0s [id=6f67cfb1d4a75717435bf31bf92b7fd4c4022d35]
module.efs.data.utils_deep_merge_yaml.values: Read complete after 0s [id=b8edaa52255d79b673654634ef4fa4fb76be6ed0]
module.prometheus-stack.module.kube-prometheus-stack.random_password.grafana_admin_password: Refreshing state... [id=none]
module.prometheus-stack.module.kube-prometheus-stack.random_password.oauth2_cookie_secret: Refreshing state... [id=none]
module.prometheus-stack.module.kube-prometheus-stack.argocd_project.this: Refreshing state... [id=kube-prometheus-stack]
module.prometheus-stack.module.kube-prometheus-stack.null_resource.dependencies: Refreshing state... [id=5314859138751491171]
module.ingress.module.traefik.module.traefik.argocd_application.this: Refreshing state... [id=traefik]
module.ingress.module.traefik.module.traefik.null_resource.this: Refreshing state... [id=1324087202604745288]
module.efs.argocd_application.this: Refreshing state... [id=efs-csi-driver]
module.prometheus-stack.module.kube-prometheus-stack.argocd_application.this: Refreshing state... [id=kube-prometheus-stack]
module.prometheus-stack.module.kube-prometheus-stack.null_resource.this: Refreshing state... [id=562931740272750918]
module.prometheus-stack.module.kube-prometheus-stack.kubernetes_secret.thanos_s3_bucket_secret[0]: Refreshing state... [id=kube-prometheus-stack/thanos-objectstorage]
module.cert-manager.module.cert-manager.argocd_project.this: Refreshing state... [id=cert-manager]
module.loki-stack.module.loki-stack.null_resource.dependencies: Refreshing state... [id=3017727993506857081]
module.cert-manager.module.cert-manager.null_resource.dependencies: Refreshing state... [id=6305494718065854911]
module.loki-stack.module.loki-stack.argocd_project.this: Refreshing state... [id=loki-stack]
module.cert-manager.module.iam_assumable_role_cert_manager[0].aws_iam_role.this[0]: Refreshing state... [id=cert-manager-gh-v1-cluster]
module.cert-manager.aws_iam_policy.cert_manager["is-sandbox.camptocamp.com"]: Refreshing state... [id=arn:aws:iam::047488060046:policy/cert-manager20221122071109927400000013]
module.loki-stack.module.loki-stack.argocd_application.this: Refreshing state... [id=loki-stack]
module.loki-stack.module.loki-stack.null_resource.this: Refreshing state... [id=6349547858644879217]
module.grafana.null_resource.dependencies: Refreshing state... [id=7007784656215510763]
module.grafana.random_password.oauth2_cookie_secret: Refreshing state... [id=none]
module.grafana.argocd_project.this: Refreshing state... [id=grafana]
module.grafana.random_password.grafana_admin_password: Refreshing state... [id=none]
module.grafana.argocd_application.this: Refreshing state... [id=grafana]
module.grafana.null_resource.this: Refreshing state... [id=4315119654403790207]
module.cert-manager.module.iam_assumable_role_cert_manager[0].aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cert-manager-gh-v1-cluster-20221122071110306300000014]
module.cert-manager.module.cert-manager.argocd_application.this: Refreshing state... [id=cert-manager]
module.cert-manager.module.cert-manager.null_resource.this: Refreshing state... [id=6082764919154668080]
module.argocd.null_resource.dependencies: Refreshing state... [id=4523965684607524915]
module.argocd.argocd_project.this: Refreshing state... [id=argocd]
module.argocd.argocd_application.this: Refreshing state... [id=argocd]
module.argocd.null_resource.this: Refreshing state... [id=7011484090444405112]
module.helloworld_apps.argocd_project.this: Refreshing state... [id=helloworld-apps]
module.metrics_server.argocd_project.this: Refreshing state... [id=metrics-server]
module.metrics_server.argocd_application.this: Refreshing state... [id=metrics-server]
module.helloworld_apps.argocd_application.this: Refreshing state... [id=helloworld-apps]
module.metrics_server.null_resource.this: Refreshing state... [id=6682558701299751096]
module.helloworld_apps.null_resource.this: Refreshing state... [id=6230816147359660485]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.data.utils_deep_merge_yaml.values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = (sensitive value)
      + output = (known after apply)
    }

  # module.argocd.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "argocd"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                  ~ values      = <<-EOT
                        argo-cd:
                          configs:
                            secret:
                              argocdServerAdminPassword: $2a$10$KO.m/6iXUW49BDKo8hPgpegbWd1s.4NqoRpdiL9vTLbDCFy4Di0qm
                              argocdServerAdminPasswordMtime: "2020-07-23T11:31:23Z"
                              extra:
                                accounts.pipeline.tokens: '[{"iat":1669100848,"id":"c1140237-c5a9-3113-2e58-5da628950ac0"}]'
                                oidc.default.clientSecret: en3ilgjehmg3c3a2n4g8c4v27lorufirv003u3fuud0rdqlfvfn
                                server.secretkey: Urrx421BK7lA6bBoi71tBnnWMEuL1nCL
                          controller:
                            metrics:
                              enabled: true
                          dex:
                            enabled: false
                          repoServer:
                            metrics:
                              enabled: true
                          server:
                            config:
                              accounts.pipeline: apiKey
                              admin.enabled: "false"
                              configManagementPlugins: |
                                - name: kustomized-helm
                                  init:
                                    command: ["/bin/sh", "-c"]
                                    args: ["helm dependency build || true"]
                                  generate:
                                    command: ["/bin/sh", "-c"]
                                    args: ["echo \"$HELM_VALUES\" | helm template . --name-template $ARGOCD_APP_NAME --namespace $ARGOCD_APP_NAMESPACE $HELM_ARGS -f - --include-crds > all.yaml && kustomize build"]
                              oidc.config: |+
                                "clientID": "4cfi6tn57gj0qdr483h0qu2nug"
                                "clientSecret": "$oidc.default.clientSecret"
                                "issuer": "https://cognito-idp.eu-west-1.amazonaws.com/eu-west-1_S4w8tEVAZ"
                                "name": "OIDC"
                                "requestedIDTokenClaims":
                                  "groups":
                                    "essential": true
                                "requestedScopes":
                                - "openid"
                                - "profile"
                                - "email"
                        
                              resource.customizations: |
                                argoproj.io/Application:
                                  health.lua: |
                                    hs = {}
                                    hs.status = "Progressing"
                                    hs.message = ""
                                    if obj.status ~= nil then
                                      if obj.status.health ~= nil then
                                        hs.status = obj.status.health.status
                                        if obj.status.health.message ~= nil then
                                          hs.message = obj.status.health.message
                                        end
                                      end
                                    end
                                    return hs
                                networking.k8s.io/Ingress:
                                  health.lua: |
                                    hs = {}
                                    hs.status = "Healthy"
                                    return hs
                              url: https://argocd.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                            extraArgs:
                            - --insecure
                            ingress:
                              annotations:
                                cert-manager.io/cluster-issuer: letsencrypt-staging
                                ingress.kubernetes.io/ssl-redirect: "true"
                                kubernetes.io/ingress.allow-http: "false"
                                traefik.ingress.kubernetes.io/router.entrypoints: websecure
                                traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                                traefik.ingress.kubernetes.io/router.tls: "true"
                              enabled: true
                              hosts:
                              - argocd.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                              - argocd.apps.is-sandbox.camptocamp.com
                              tls:
                              - hosts:
                                - argocd.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                - argocd.apps.is-sandbox.camptocamp.com
                                secretName: argocd-tls
                            metrics:
                              enabled: true
                            rbacConfig:
                              policy.csv: |
                                g, pipeline, role:admin
                                g, argocd-admin, role:admin
                              policy.default: ""
                              scopes: '[groups, cognito:groups, roles]'
                    EOT -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cert-manager.data.aws_iam_policy_document.cert_manager["is-sandbox.camptocamp.com"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cert_manager" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "route53:ListHostedZonesByName",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "route53:ChangeResourceRecordSets",
              + "route53:ListResourceRecordSets",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "route53:GetChange",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:route53:::change/*",
            ]
        }
    }

  # module.cert-manager.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.cert-manager.data.aws_route53_zone.this["is-sandbox.camptocamp.com"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "this" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "is-sandbox.camptocamp.com"
      + name_servers               = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.cert-manager.aws_iam_policy.cert_manager["is-sandbox.camptocamp.com"] will be updated in-place
  ~ resource "aws_iam_policy" "cert_manager" {
        id          = "arn:aws:iam::047488060046:policy/cert-manager20221122071109927400000013"
        name        = "cert-manager20221122071109927400000013"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:ListHostedZonesByName"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "route53:ListResourceRecordSets",
                          - "route53:ChangeResourceRecordSets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/Z02344701J76N99N4DJK6"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "route53:GetChange"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::change/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.efs.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "efs-csi-driver"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ sync_policy {
              ~ automated    = {
                  - "allow_empty" = false -> null
                    # (2 unchanged elements hidden)
                }
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.grafana.data.utils_deep_merge_yaml.values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + (sensitive value),
        ]
      + output = (known after apply)
    }

  # module.grafana.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "grafana"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                  ~ values      = <<-EOT
                        grafana:
                          adminPassword: 7uPy0J0je3IgdoYT
                          grafana.ini:
                            auth.generic_oauth:
                              allow_sign_up: true
                              api_url: https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo
                              auth_url: https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/authorize
                              client_id: 4cfi6tn57gj0qdr483h0qu2nug
                              client_secret: en3ilgjehmg3c3a2n4g8c4v27lorufirv003u3fuud0rdqlfvfn
                              enabled: true
                              scopes: openid profile email
                              token_url: https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/token
                            server:
                              domain: grafana.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                              root_url: https://%(domain)s
                            users:
                              auto_assign_org_role: Editor
                          ingress:
                            annotations:
                              cert-manager.io/cluster-issuer: letsencrypt-staging
                              ingress.kubernetes.io/ssl-redirect: "true"
                              kubernetes.io/ingress.allow-http: "false"
                              traefik.ingress.kubernetes.io/router.entrypoints: websecure
                              traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                              traefik.ingress.kubernetes.io/router.tls: "true"
                            enabled: true
                            hosts:
                            - grafana.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                            - grafana.apps.is-sandbox.camptocamp.com
                            tls:
                            - hosts:
                              - grafana.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                              - grafana.apps.is-sandbox.camptocamp.com
                              secretName: grafana-tls
                    EOT -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.metrics_server.data.utils_deep_merge_yaml.values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = []
      + output = (known after apply)
    }

  # module.metrics_server.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "metrics-server"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                  ~ values      = jsonencode({}) -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.thanos.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + (sensitive value),
        ]
      + output = (known after apply)
    }

  # module.thanos.argocd_application.this will be created
  + resource "argocd_application" "this" {
      + cascade = true
      + id      = (known after apply)
      + wait    = true

      + metadata {
          + generation       = (known after apply)
          + name             = "thanos"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "thanos"
          + revision_history_limit = 10

          + destination {
              + name      = "in-cluster"
              + namespace = "thanos"
            }

          + source {
              + path            = "charts/thanos"
              + repo_url        = "https://github.com/camptocamp/devops-stack-module-thanos.git"
              + target_revision = "v1.0.0-alpha.4"

              + helm {
                  + values = (known after apply)
                }
            }

          + sync_policy {
              + automated    = {
                  + "allow_empty" = false
                  + "prune"       = true
                  + "self_heal"   = true
                }
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + retry {
                  + backoff = {
                      + "duration"     = ""
                      + "max_duration" = ""
                    }
                  + limit   = "0"
                }
            }
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
        }
    }

  # module.thanos.argocd_project.this will be created
  + resource "argocd_project" "this" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "devops-stack.io/argocd_namespace" = "argocd"
            }
          + generation       = (known after apply)
          + name             = "thanos"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + description  = "thanos application project"
          + source_repos = [
              + "https://github.com/camptocamp/devops-stack-module-thanos.git",
            ]

          + cluster_resource_whitelist {
              + group = "*"
              + kind  = "*"
            }

          + destination {
              + name      = "in-cluster"
              + namespace = "thanos"
            }

          + orphaned_resources {
              + warn = true
            }
        }
    }

  # module.thanos.null_resource.dependencies will be created
  + resource "null_resource" "dependencies" {
      + id       = (known after apply)
      + triggers = {}
    }

  # module.thanos.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

  # module.thanos.random_password.oauth2_cookie_secret will be created
  + resource "random_password" "oauth2_cookie_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.cert-manager.module.cert-manager.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + (known after apply),
        ]
      + output = (known after apply)
    }

  # module.cert-manager.module.cert-manager.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "cert-manager"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                  ~ values      = <<-EOT
                        cert-manager:
                          clusterIssuers:
                            acme:
                              solvers:
                              - dns01:
                                  route53:
                                    region: eu-west-1
                                selector:
                                  dnsZones:
                                  - is-sandbox.camptocamp.com
                              - http01:
                                  ingress: {}
                            letsencrypt:
                              enabled: true
                          serviceAccount:
                            annotations:
                              eks.amazonaws.com/role-arn: arn:aws:iam::047488060046:role/cert-manager-gh-v1-cluster
                    EOT -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (3 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cert-manager.module.iam_assumable_role_cert_manager[0].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.cert-manager.module.iam_assumable_role_cert_manager[0].data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:cert-manager:cert-manager",
                ]
              + variable = "oidc.eks.eu-west-1.amazonaws.com/id/4E77C1B36279EE76EE8DDCD760A6EBD5:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cert-manager.module.iam_assumable_role_cert_manager[0].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.cert-manager.module.iam_assumable_role_cert_manager[0].aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-west-1.amazonaws.com/id/4E77C1B36279EE76EE8DDCD760A6EBD5:sub" = "system:serviceaccount:cert-manager:cert-manager"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::047488060046:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/4E77C1B36279EE76EE8DDCD760A6EBD5"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "cert-manager-gh-v1-cluster"
        name                  = "cert-manager-gh-v1-cluster"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.loki-stack.module.loki-stack.data.utils_deep_merge_yaml.values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + <<-EOT
                "loki-stack":
                  "loki":
                    "serviceMonitor":
                      "enabled": true
                    "serviceName": "loki-stack.loki-stack"
                  "promtail":
                    "filebeat":
                      "extraContainers": |
                        - name: filebeat-prometheus-exporter
                          image: "trustpilot/beat-exporter:0.4.0"
                          ports:
                          - containerPort: 9479
                            protocol: TCP
                            name: metrics
                    "serviceMonitor":
                      "enabled": true
            EOT,
          + <<-EOT
                "loki-stack":
                  "loki":
                    "config":
                      "schema_config":
                        "configs":
                        - "from": "2020-10-24"
                          "index":
                            "period": "24h"
                            "prefix": "index_"
                          "object_store": "s3"
                          "schema": "v11"
                          "store": "boltdb-shipper"
                      "storage_config":
                        "aws":
                          "s3": "s3://eu-west-1/loki-log-storage-gh-v1-cluster"
                        "boltdb_shipper":
                          "active_index_directory": "/data/loki/index"
                          "cache_location": "/data/loki/boltdb-cache"
                          "shared_store": "s3"
                    "serviceAccount":
                      "annotations":
                        "eks.amazonaws.com/role-arn": "arn:aws:iam::047488060046:role/loki-s3-role-gh-v1-cluster"
            EOT,
        ]
      + output = (known after apply)
    }

  # module.loki-stack.module.loki-stack.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "loki-stack"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                  ~ values      = <<-EOT
                        loki-stack:
                          loki:
                            config:
                              schema_config:
                                configs:
                                - from: "2020-10-24"
                                  index:
                                    period: 24h
                                    prefix: index_
                                  object_store: s3
                                  schema: v11
                                  store: boltdb-shipper
                              storage_config:
                                aws:
                                  s3: s3://eu-west-1/loki-log-storage-gh-v1-cluster
                                boltdb_shipper:
                                  active_index_directory: /data/loki/index
                                  cache_location: /data/loki/boltdb-cache
                                  shared_store: s3
                            serviceAccount:
                              annotations:
                                eks.amazonaws.com/role-arn: arn:aws:iam::047488060046:role/loki-s3-role-gh-v1-cluster
                            serviceMonitor:
                              enabled: true
                            serviceName: loki-stack.loki-stack
                          promtail:
                            filebeat:
                              extraContainers: |
                                - name: filebeat-prometheus-exporter
                                  image: "trustpilot/beat-exporter:0.4.0"
                                  ports:
                                  - containerPort: 9479
                                    protocol: TCP
                                    name: metrics
                            serviceMonitor:
                              enabled: true
                    EOT -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.prometheus-stack.module.kube-prometheus-stack.data.utils_deep_merge_yaml.values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + (sensitive value),
          + <<-EOT
                "kube-prometheus-stack":
                  "prometheus":
                    "serviceAccount":
                      "annotations":
                        "eks.amazonaws.com/role-arn": "arn:aws:iam::047488060046:role/thanos-s3-role-gh-v1-cluster"
            EOT,
        ]
      + output = (known after apply)
    }

  # module.prometheus-stack.module.kube-prometheus-stack.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "kube-prometheus-stack"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ plugin {
                    name = "kustomized-helm"

                  - env {
                      - name  = "HELM_VALUES" -> null
                      - value = <<-EOT
                            kube-prometheus-stack:
                              alertmanager:
                                alertmanagerSpec:
                                  containers:
                                  - args:
                                    - --http-address=0.0.0.0:9095
                                    - --upstream=http://localhost:9093
                                    - --provider=oidc
                                    - --oidc-issuer-url=https://cognito-idp.eu-west-1.amazonaws.com/eu-west-1_S4w8tEVAZ
                                    - --client-id=4cfi6tn57gj0qdr483h0qu2nug
                                    - --client-secret=en3ilgjehmg3c3a2n4g8c4v27lorufirv003u3fuud0rdqlfvfn
                                    - --cookie-secure=false
                                    - --cookie-secret=yL9gdCzoe57lPhDe
                                    - --email-domain=*
                                    - --redirect-url=https://alertmanager.apps.gh-v1-cluster.is-sandbox.camptocamp.com/oauth2/callback
                                    image: quay.io/oauth2-proxy/oauth2-proxy:v7.1.3
                                    name: alertmanager-proxy
                                    ports:
                                    - containerPort: 9095
                                      name: web
                                  initContainers:
                                  - args:
                                    - |
                                      until curl -skL -w "%{http_code}\\n" "https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo" -o /dev/null | grep -vq "^\(000\|404\)$"; do echo "waiting for oidc at https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo"; sleep 2; done
                                    command:
                                    - /bin/sh
                                    - -c
                                    image: curlimages/curl:7.79.1
                                    name: wait-for-oidc
                                enabled: true
                                ingress:
                                  annotations:
                                    cert-manager.io/cluster-issuer: letsencrypt-staging
                                    ingress.kubernetes.io/ssl-redirect: "true"
                                    kubernetes.io/ingress.allow-http: "false"
                                    traefik.ingress.kubernetes.io/router.entrypoints: websecure
                                    traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                                    traefik.ingress.kubernetes.io/router.tls: "true"
                                  enabled: true
                                  hosts:
                                  - alertmanager.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                  - alertmanager.apps.is-sandbox.camptocamp.com
                                  tls:
                                  - hosts:
                                    - alertmanager.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                    - alertmanager.apps.is-sandbox.camptocamp.com
                                    secretName: alertmanager-tls
                                service:
                                  targetPort: 9095
                                serviceMonitor:
                                  selfMonitor: false
                              grafana:
                                additionalDataSources:
                                - access: proxy
                                  isDefault: true
                                  jsonData:
                                    oauthPassThru: true
                                    tlsAuth: false
                                    tlsAuthWithCACert: false
                                  name: Thanos
                                  type: prometheus
                                  url: http://thanos-query.thanos:9090
                                enabled: false
                                forceDeployDashboards: true
                                forceDeployDatasources: true
                                sidecar:
                                  datasources:
                                    defaultDatasourceEnabled: false
                              prometheus:
                                additionalPodMonitors:
                                - name: alertmanager
                                  namespaceSelector:
                                    matchNames:
                                    - kube-prometheus-stack
                                  podMetricsEndpoints:
                                  - path: /metrics
                                    targetPort: 9093
                                  selector:
                                    matchLabels:
                                      alertmanager: kube-prometheus-stack-alertmanager
                                      app: alertmanager
                                - name: prometheus
                                  namespaceSelector:
                                    matchNames:
                                    - kube-prometheus-stack
                                  podMetricsEndpoints:
                                  - path: /metrics
                                    targetPort: 9090
                                  selector:
                                    matchLabels:
                                      app: prometheus
                                      prometheus: kube-prometheus-stack-prometheus
                                enabled: true
                                ingress:
                                  annotations:
                                    cert-manager.io/cluster-issuer: letsencrypt-staging
                                    ingress.kubernetes.io/ssl-redirect: "true"
                                    kubernetes.io/ingress.allow-http: "false"
                                    traefik.ingress.kubernetes.io/router.entrypoints: websecure
                                    traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                                    traefik.ingress.kubernetes.io/router.tls: "true"
                                  enabled: true
                                  hosts:
                                  - prometheus.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                  - prometheus.apps.is-sandbox.camptocamp.com
                                  tls:
                                  - hosts:
                                    - prometheus.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                    - prometheus.apps.is-sandbox.camptocamp.com
                                    secretName: prometheus-tls
                                prometheusSpec:
                                  alertingEndpoints:
                                  - name: kube-prometheus-stack-alertmanager
                                    namespace: kube-prometheus-stack
                                    port: 9093
                                  containers:
                                  - args:
                                    - --http-address=0.0.0.0:9091
                                    - --upstream=http://localhost:9090
                                    - --provider=oidc
                                    - --oidc-issuer-url=https://cognito-idp.eu-west-1.amazonaws.com/eu-west-1_S4w8tEVAZ
                                    - --client-id=4cfi6tn57gj0qdr483h0qu2nug
                                    - --client-secret=en3ilgjehmg3c3a2n4g8c4v27lorufirv003u3fuud0rdqlfvfn
                                    - --cookie-secure=false
                                    - --cookie-secret=yL9gdCzoe57lPhDe
                                    - --email-domain=*
                                    - --redirect-url=https://prometheus.apps.gh-v1-cluster.is-sandbox.camptocamp.com/oauth2/callback
                                    image: quay.io/oauth2-proxy/oauth2-proxy:v7.1.3
                                    name: prometheus-proxy
                                    ports:
                                    - containerPort: 9091
                                      name: proxy
                                  externalLabels:
                                    prometheus: prometheus-gh-v1-cluster
                                  initContainers:
                                  - args:
                                    - |
                                      until curl -skL -w "%{http_code}\\n" "https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo" -o /dev/null | grep -vq "^\(000\|404\)$"; do echo "waiting for oidc at https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo"; sleep 2; done
                                    command:
                                    - /bin/sh
                                    - -c
                                    image: curlimages/curl:7.79.1
                                    name: wait-for-oidc
                                  portName: proxy
                                  thanos:
                                    objectStorageConfig:
                                      key: thanos.yaml
                                      name: thanos-objectstorage
                                service:
                                  additionalPorts:
                                  - name: web
                                    port: 9090
                                    targetPort: 9090
                                  port: 9091
                                  targetPort: 9091
                                serviceAccount:
                                  annotations:
                                    eks.amazonaws.com/role-arn: arn:aws:iam::047488060046:role/thanos-s3-role-gh-v1-cluster
                                serviceMonitor:
                                  selfMonitor: false
                                thanosService:
                                  enabled: true
                        EOT -> null
                    }
                  + env {
                      + name  = "HELM_VALUES"
                      + value = (known after apply)
                    }
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.thanos.module.thanos.argocd_application.this will be destroyed
  # (because argocd_application.this is not in configuration)
  - resource "argocd_application" "this" {
      - cascade = true -> null
      - id      = "thanos" -> null
      - wait    = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 74 -> null
          - labels           = {} -> null
          - name             = "thanos" -> null
          - namespace        = "argocd" -> null
          - resource_version = "60174" -> null
          - uid              = "c706c9a9-d299-4dd3-bd94-8d4b39efd59f" -> null
        }

      - spec {
          - project                = "thanos" -> null
          - revision_history_limit = 10 -> null

          - destination {
              - name      = "in-cluster" -> null
              - namespace = "thanos" -> null
            }

          - source {
              - path            = "charts/thanos" -> null
              - repo_url        = "https://github.com/camptocamp/devops-stack-module-thanos.git" -> null
              - target_revision = "v1.0.0-alpha.4" -> null

              - helm {
                  - skip_crds   = false -> null
                  - value_files = [] -> null
                  - values      = <<-EOT
                        thanos:
                          bucketweb:
                            enabled: "true"
                            ingress:
                              annotations:
                                cert-manager.io/cluster-issuer: letsencrypt-staging
                                ingress.kubernetes.io/ssl-redirect: "true"
                                kubernetes.io/ingress.allow-http: "false"
                                traefik.ingress.kubernetes.io/router.entrypoints: websecure
                                traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                                traefik.ingress.kubernetes.io/router.tls: "true"
                              enabled: "true"
                              extraRules:
                              - host: thanos-bucketweb.apps.is-sandbox.camptocamp.com
                                http:
                                  paths:
                                  - backend:
                                      service:
                                        name: thanos-bucketweb
                                        port:
                                          name: proxy
                                    path: /
                                    pathType: ImplementationSpecific
                              - host: thanos-bucketweb.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                http:
                                  paths:
                                  - backend:
                                      service:
                                        name: thanos-bucketweb
                                        port:
                                          name: proxy
                                    path: /
                                    pathType: ImplementationSpecific
                              extraTls:
                              - hosts:
                                - thanos-bucketweb.apps.is-sandbox.camptocamp.com
                                - thanos-bucketweb.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                secretName: thanos-bucketweb-tls
                              hostname: ""
                              tls: false
                            service:
                              extraPorts:
                              - name: proxy
                                port: 9075
                                protocol: TCP
                                targetPort: proxy
                            serviceAccount:
                              annotations:
                                eks.amazonaws.com/role-arn: arn:aws:iam::047488060046:role/thanos-s3-role-gh-v1-cluster
                            sidecars:
                            - args:
                              - --http-address=0.0.0.0:9075
                              - --upstream=http://localhost:8080
                              - --provider=oidc
                              - --oidc-issuer-url=https://cognito-idp.eu-west-1.amazonaws.com/eu-west-1_S4w8tEVAZ
                              - --client-id=4cfi6tn57gj0qdr483h0qu2nug
                              - --client-secret=en3ilgjehmg3c3a2n4g8c4v27lorufirv003u3fuud0rdqlfvfn
                              - --cookie-secure=false
                              - --cookie-secret=ZUDqYE6N5CfzF1m7
                              - --email-domain=*
                              - --redirect-url=https://thanos-bucketweb.apps.gh-v1-cluster.is-sandbox.camptocamp.com/oauth2/callback
                              image: quay.io/oauth2-proxy/oauth2-proxy:v7.1.3
                              name: thanos-proxy
                              ports:
                              - containerPort: 9075
                                name: proxy
                          compactor:
                            enabled: true
                            persistence:
                              accessModes:
                              - ReadWriteOnce
                              size: 8Gi
                            resources:
                              limits:
                                memory: 1Gi
                            retentionResolution1h: 240d
                            retentionResolution5m: 120d
                            retentionResolutionRaw: 60d
                            serviceAccount:
                              annotations:
                                eks.amazonaws.com/role-arn: arn:aws:iam::047488060046:role/thanos-s3-role-gh-v1-cluster
                          objstoreConfig:
                            config:
                              bucket: thanos-metrics-storage-gh-v1-cluster
                              endpoint: s3.amazonaws.com
                              insecure: false
                              region: eu-west-1
                              signature_version2: false
                            type: S3
                          query:
                            dnsDiscovery:
                              enabled: true
                              sidecarsNamespace: kube-prometheus-stack
                              sidecarsService: kube-prometheus-stack-thanos-discovery
                            resources:
                              limits:
                                memory: 1Gi
                            stores:
                            - thanos-storegateway:10901
                          queryFrontend:
                            ingress:
                              annotations:
                                cert-manager.io/cluster-issuer: letsencrypt-staging
                                ingress.kubernetes.io/ssl-redirect: "true"
                                kubernetes.io/ingress.allow-http: "false"
                                traefik.ingress.kubernetes.io/router.entrypoints: websecure
                                traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                                traefik.ingress.kubernetes.io/router.tls: "true"
                              enabled: "true"
                              extraRules:
                              - host: thanos-query.apps.is-sandbox.camptocamp.com
                                http:
                                  paths:
                                  - backend:
                                      service:
                                        name: thanos-query-frontend
                                        port:
                                          name: proxy
                                    path: /
                                    pathType: ImplementationSpecific
                              - host: thanos-query.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                http:
                                  paths:
                                  - backend:
                                      service:
                                        name: thanos-query-frontend
                                        port:
                                          name: proxy
                                    path: /
                                    pathType: ImplementationSpecific
                              extraTls:
                              - hosts:
                                - thanos-query.apps.is-sandbox.camptocamp.com
                                - thanos-query.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                secretName: thanos-query-tls
                              hostname: ""
                              tls: false
                            service:
                              extraPorts:
                              - name: proxy
                                port: 9075
                                protocol: TCP
                                targetPort: proxy
                            sidecars:
                            - args:
                              - --http-address=0.0.0.0:9075
                              - --upstream=http://localhost:10902
                              - --provider=oidc
                              - --oidc-issuer-url=https://cognito-idp.eu-west-1.amazonaws.com/eu-west-1_S4w8tEVAZ
                              - --client-id=4cfi6tn57gj0qdr483h0qu2nug
                              - --client-secret=en3ilgjehmg3c3a2n4g8c4v27lorufirv003u3fuud0rdqlfvfn
                              - --cookie-secure=false
                              - --cookie-secret=ZUDqYE6N5CfzF1m7
                              - --email-domain=*
                              - --redirect-url=https://thanos-query.apps.gh-v1-cluster.is-sandbox.camptocamp.com/oauth2/callback
                              image: quay.io/oauth2-proxy/oauth2-proxy:v7.1.3
                              name: thanos-proxy
                              ports:
                              - containerPort: 9075
                                name: proxy
                          storegateway:
                            enabled: true
                            persistence:
                              enabled: false
                            resources:
                              limits:
                                memory: 1Gi
                            serviceAccount:
                              annotations:
                                eks.amazonaws.com/role-arn: arn:aws:iam::047488060046:role/thanos-s3-role-gh-v1-cluster
                    EOT -> null
                }
            }

          - sync_policy {
              - automated    = {
                  - "allow_empty" = false
                  - "prune"       = true
                  - "self_heal"   = true
                } -> null
              - sync_options = [
                  - "CreateNamespace=true",
                ] -> null

              - retry {
                  - backoff = {
                      - "duration"     = ""
                      - "max_duration" = ""
                    } -> null
                  - limit   = "0" -> null
                }
            }
        }

      - timeouts {
          - create = "15m" -> null
          - delete = "15m" -> null
        }
    }

  # module.thanos.module.thanos.argocd_project.this will be destroyed
  # (because argocd_project.this is not in configuration)
  - resource "argocd_project" "this" {
      - id = "thanos" -> null

      - metadata {
          - annotations      = {
              - "devops-stack.io/argocd_namespace" = "argocd"
            } -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "thanos" -> null
          - namespace        = "argocd" -> null
          - resource_version = "29816" -> null
          - uid              = "6e12cfa6-c6e8-40ab-8d2e-766c75044862" -> null
        }

      - spec {
          - description    = "thanos application project" -> null
          - signature_keys = [] -> null
          - source_repos   = [
              - "https://github.com/camptocamp/devops-stack-module-thanos.git",
            ] -> null

          - cluster_resource_whitelist {
              - group = "*" -> null
              - kind  = "*" -> null
            }

          - destination {
              - name      = "in-cluster" -> null
              - namespace = "thanos" -> null
            }

          - orphaned_resources {
              - warn = true -> null
            }
        }
    }

  # module.thanos.module.thanos.null_resource.dependencies will be destroyed
  # (because null_resource.dependencies is not in configuration)
  - resource "null_resource" "dependencies" {
      - id       = "1330642774921619759" -> null
      - triggers = {} -> null
    }

  # module.thanos.module.thanos.null_resource.this will be destroyed
  # (because null_resource.this is not in configuration)
  - resource "null_resource" "this" {
      - id = "413328150136466538" -> null
    }

  # module.thanos.module.thanos.random_password.oauth2_cookie_secret will be destroyed
  # (because random_password.oauth2_cookie_secret is not in configuration)
  - resource "random_password" "oauth2_cookie_secret" {
      - bcrypt_hash = (sensitive value)
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

Plan: 5 to add, 9 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @lentidas, Action: `pull_request`, Working Directory: ``, Workflow: `Automatic terraform plan on PR`*